// =================================
// 愷威癲癇紀錄系統 V2.0
// data.js
// =================================



// ===============================
// 發作地點
// ===============================


const locationList = [


"教室",

"操場",

"廁所",

"保健室",

"校車",

"其他"


];






// ===============================
// 發作型態
// ===============================


const seizureTypeList = [


"全身抽搐",

"眼神固定",

"失神",

"四肢僵硬",

"嘴唇發紫",

"流口水",

"其他"


];







// ===============================
// 意識狀態
// ===============================


const awarenessList = [


"清醒",

"反應變慢",

"無反應",

"昏睡",

"其他"


];








// ===============================
// 發作後狀態
// ===============================


const afterStateList = [


"恢復正常",

"疲倦",

"想睡",

"頭暈",

"噁心",

"其他"


];







// ===============================
// 醫療資訊
// ===============================


const medicalInfo = {


name:
"愷威",


disease:
"卓飛症候群",


hospital:
"",


doctor:
"",


medicine:
"",


emergencyMedicine:
"",


note:
""



};








// ===============================
// 緊急聯絡人
// ===============================


const emergencyContacts = [


{

name:"爸爸",

phone:"0916398937"

},


{

name:"奶奶",

phone:"0905083604"

},


{

name:"爺爺",

phone:"0932000929"

},


{

name:"叔叔",

phone:"0975108215"

}


];
